cf/BusinessProcesses/ДоставкаЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<BusinessProcess>
		<Properties>
			<Name>ДоставкаЗаказа</Name>
			<Task>Task.ЗадачаПользователю</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Заказ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОтгрузки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументПеремещенияТоваров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаХраненияЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/Enums/СостоянияЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СостоянияЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСборку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСкладПовторно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПеремещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгруженЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собирается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собран</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобранЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьЗаявку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятьИнструмент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьГарантию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвестиДефектовку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьНаСкладВыдачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредупредитьКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьСКлиентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненПоТехническимПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Редактируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
					<Comment>Когда товар отправлен в доставку</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
					<Comment>Когда товар принял получатель или транспортная компания</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставленЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/BusinessProcesses/ДоставкаЗаказа/Forms/Задача_ОтправитьЗаказКлиенту/Ext/Form/Module.bsl
&НаКлиенте
Перем МассивКомментариев Экспорт;

&НаСервере
Функция ВыполнитьЗадачуСервер(ЗаказОтправлен)
	Если   ТипЗнч(Заказ)=Тип("ДокументСсылка.ЗаказПокупателя")
	   Или ТипЗнч(Заказ)=Тип("ДокументСсылка.ИнтернетЗаказПокупателя")
	   Или ТипЗнч(Заказ)=Тип("ДокументСсылка.ВнутреннийЗаказ") Тогда
		ВсеТоварыОтгружаются = Заказы.ВсеТоварыОтгружаются(Заказ);
	Иначе
		ВсеТоварыОтгружаются = Истина;
	КонецЕсли;
	Если ЗаказОтправлен=1 Тогда
		СостояниеОтгрузки = "Отправлен";
		СостояниеЗаказа = ?(ВсеТоварыОтгружаются,"Отправлен","ОтправленЧастично");
	ИначеЕсли ЗаказОтправлен=2 Тогда
		СостояниеОтгрузки = "Отгружен";
		СостояниеЗаказа = ?(ВсеТоварыОтгружаются,"Отгружен","ОтгруженЧастично");
	ИначеЕсли ЗаказОтправлен=3 Тогда
		СостояниеОтгрузки = "Доставлен";
		СостояниеЗаказа = ?(ВсеТоварыОтгружаются,"Доставлен","ДоставленЧастично");
	КонецЕсли;
	
	НачатьТранзакцию();
	
	// Установим статус
	Если НЕ Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа[СостояниеЗаказа]) ИЛИ НЕ Заказы.УстановитьСостояниеДокументаОтгрузки(ДокументОтгрузки,СостояниеОтгрузки) Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
						
	Если Не Записать(Новый Структура("ВыполнитьЗадачу", Истина)) Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗаказОтправлен=2 И ЗначениеЗаполнено(ЯчейкаХраненияЗаказа) Тогда
		БПОбъект = Объект.БизнесПроцесс.ПолучитьОбъект();
		БПОбъект.ЯчейкаХраненияЗаказа = ЯчейкаХраненияЗаказа;
		БПОбъект.Записать();
		
		Если ТипЗнч(ДокументОтгрузки) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
			Для Каждого ТекСборка Из ДокументОтгрузки.СобранныеТовары Цикл
				Если ЗначениеЗаполнено(ТекСборка.СборочныйЛист) И ТекСборка.СборочныйЛист.ЯчейкаСобранногоТовара <> ЯчейкаХраненияЗаказа Тогда
					ТекОбъект = ТекСборка.СборочныйЛист.ПолучитьОбъект();
					ТекОбъект.ЯчейкаСобранногоТовара = ЯчейкаХраненияЗаказа;
					ТекОбъект.Записать();
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ДокументОтгрузки) = Тип("ДокументСсылка.ОтгрузкаТоваров") Тогда
			Если ЗначениеЗаполнено(ДокументОтгрузки.СборочныйЛист) И ТекОбъект.ЯчейкаСобранногоТовара <> ЯчейкаХраненияЗаказа Тогда
				ТекОбъект = ДокументОтгрузки.ПолучитьОбъект();
				ТекОбъект.ЯчейкаСобранногоТовара = ЯчейкаХраненияЗаказа;
				ТекОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

// ТИПОВЫЕ

&НаКлиенте
Процедура ПоказатьСкрытьАдресацию(Команда)
	
	// Реверснем
	
	КоманднаяПанель.ПодчиненныеЭлементы.ПоказатьСкрытьАдресацию.Пометка = Не КоманднаяПанель.ПодчиненныеЭлементы.ПоказатьСкрытьАдресацию.Пометка;
	
	// Обновим видимость
	
	ФункцииФормЗадач.ВидимостьАдресации(ЭтаФорма);
	
КонецПроцедуры
&НаСервере
Процедура ПрочитатьРеквизиты()
	
	ФункцииБизнесПроцессов.ЗаполнитьДанные(ЭтаФорма, 
		Объект.Ссылка.БизнесПроцесс, 
		Объект.Ссылка);
		
КонецПроцедуры
&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	ЭтоТекущаяЗадача = Не Объект.Выполнена;
		
	Элементы.КнопкаОтправитьИЗакрыть.Видимость = ЭтоТекущаяЗадача;
	Элементы.ФормаКнопкаОтменитьИЗакрыть.Видимость = ЭтоТекущаяЗадача;
	Элементы.ФормаКнопкаДоставитьИЗакрыть.Видимость = ЭтоТекущаяЗадача;
	
	Элементы.ЯчейкаХраненияЗаказа.Видимость = СкладЯчеестый;
КонецПроцедуры

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// прикрепленные файлы
	ОбновитьВидимостьПрикрепленныхФайловНаСервере();
	
	// комментарии
	ФункцииБизнесПроцессов.ДобавитьРаботуСКомментариями(ЭтаФорма);

	ПрочитатьРеквизиты();
	
	// Спрячем
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

 &НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// комментарии
	ФункцииБизнесПроцессовКлиент.ПолучитьМассивКомментариев(ЭтаФорма, Объект.БизнесПроцесс);

	ФункцииФормЗадач.ПриОткрытии(Объект, ЭтаФорма, Отказ);
	
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ФункцииФормЗадач.ПослеЗаписи(Объект, ЭтаФорма, ПараметрыЗаписи);
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

// КОМАНДЫ
&НаКлиенте
Процедура КнопкаОтправитьИЗакрыть(Команда)
	Если ВыполнитьЗадачуСервер(1) Тогда Закрыть() КонецЕсли;
	ФункцииФормЗадач.ПослеЗаписи(Объект, ЭтаФорма, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтменитьИЗакрыть(Команда)
	Если ВыполнитьЗадачуСервер(2) Тогда Закрыть() КонецЕсли;
	ФункцииФормЗадач.ПослеЗаписи(Объект, ЭтаФорма, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДоставитьИЗакрыть(Команда)
	Если ВыполнитьЗадачуСервер(3) Тогда Закрыть() КонецЕсли;
	ФункцииФормЗадач.ПослеЗаписи(Объект, ЭтаФорма, Неопределено);
КонецПроцедуры

// КОММЕНТАРИИ

&НаКлиенте
Процедура КомандаПоказатьКомментарий(Команда)
	ФункцииБизнесПроцессовКлиент.КомандаПоказатьКомментарий(ЭтаФорма);
КонецПроцедуры

// ПЕЧАТЬ СБОРОЧНОГО ЛИСТА

#Область Прикрепленные_файлы

&НаКлиенте
Процедура УдалитьПрикрепленныеФайлыНажатие(Элемент)
	
	ПрикрепленныеФайлыКлиент.УдалитьНажатие(Объект.Заказ, ЭтаФорма, Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура ПрикрепленныеФайлыНажатиеСкрепка(Элемент)
	
	ПрикрепленныеФайлыКлиент.НажатиеСкрепка(Объект.Заказ, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрикрепленныйФайл(Элемент)
	
	ПрикрепленныеФайлыКлиент.ОткрытьПрикрепленныйФайл(Элемент.Имя);
	
КонецПроцедуры
&НаКлиенте
Процедура ПоказатьПрикрееленныеФайлы(Элемент)
	
	ПрикрепленныеФайлыКлиент.ПоказатьПрикрепленныеФайлы(Объект.Заказ, ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьПрикрепленныхФайловНаСервере()
	
	ПрикрепленныеФайлы.Иницилизировать(Объект.Заказ, ЭтаФорма);
	
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьВидимостьПрикрепленныхФайлов() Экспорт
	
	ОбновитьВидимостьПрикрепленныхФайловНаСервере();
	
КонецПроцедуры

#КонецОбласти
